Beginner/C1/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (0.8 0 0)
    (0.8 0.2 0)
    (0 0.2 0)
	(0 0 0.1)
	(0.8 0 0.1)
	(0.8 0.2 0.1)
	(0 0.2 0.1)
	
	(1 0 0)
	(1 0.2 0)
	(1 0 0.1)
	(1 0.2 0.1)
	
	(0.8 0.9 0)
	(0.8 1 0)
	(0.8 0.9 0.1)
	(0.8 1 0.1)
	
	(1 0.9 0)
	(1.8 0.9 0)
	(1.8 1 0)
	(1 1 0)
	(1 0.9 0.1)
	(1.8 0.9 0.1)
	(1.8 1 0.1)
	(1 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 20 1) simpleGrading (1 1 1)
	hex (1 8 9 2 5 10 11 6) (20 20 1) simpleGrading (1 1 1)
	hex (2 9 16 12 6 11 20 14) (20 70 1) simpleGrading (1 1 1)
	hex (12 16 19 13 14 20 23 15) (20 10 1) simpleGrading (1 1 1)
	hex (16 17 18 19 20 21 22 23) (80 10 1) simpleGrading (1 1 1)
	
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
	outlet
    {
        type patch;
        faces
        (
            (17 21 22 18)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 5 1)
			(1 5 10 8)
			(8 10 11 9)
			(11 20 16 9)
			(7 3 2 6)
			
			(6 14 12 2)
			(12 13 15 14)
			(23 15 13 19)
			(23 19 18 22)
			(17 16 20 21)	
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
			(1 8 9 2)
			(2 9 16 12)
			(12 16 19 13)
			(16 17 18 19)
			
			(7 6 5 4)
			(11 10 5 6)
			(14 20 11 6)
			(15 23 20 14)
			(23 22 21 20)
        );
    }
);


// ************************************************************************* //
